import random
import anitrack

def question(lang, text):
	if text is not None:
		choice = ['Я вижу... да! ✅','Я вижу... нет! 🚫','Лучше не говорить сейчас об этом. ❓','Мой ответ - нет. 🚫','Не могу сейчас предсказать.. ❓','Не зацикливайся на этом. ❓','Попробуй снова! ❓','Мои источники говорят нет! 🚫','Конечно! ✅','Вероятнее всего - да! ✅','Да. ✅','Моё мнение - да! ✅','Скорее всего - нет. 🚫','Даже не думай! 🚫']
		ttext = f"Магический шар\nТвой вопрос: {text}\n\nМой ответ:\n{random.choice(choice)}"
		result = anitrack.track.translate(lang, ttext)
		return result
	else:
		return 'None'

def answer(lang):
	choice = ['Я вижу... да! ✅','Я вижу... нет! 🚫','Лучше не говорить сейчас об этом. ❓','Мой ответ - нет. 🚫','Не могу сейчас предсказать.. ❓','Не зацикливайся на этом. ❓','Попробуй снова! ❓','Мои источники говорят нет! 🚫','Конечно! ✅','Вероятнее всего - да! ✅','Да. ✅','Моё мнение - да! ✅','Скорее всего - нет. 🚫','Даже не думай! 🚫']
	result = anitrack.track.translate(lang, random.choice(choice))
	return result